#include <iostream>
#include <math.h>
#include <cmath>
//const float M_PI = 3.14;
using namespace std; 


double sum(double num_1, double num_2){
    return num_1 + num_2;
}

double multiplication(double num_1, double num_2){
    return num_1 * num_2;
}

double division (double num_1, double num_2){
    return num_1 / num_2;
}

double pover (double num_1, double num_2){
    return (pow(num_1, num_2));
}

double root (double num_1, double num_2){
    return (pow(num_1, (1/num_2)));
}

double lg (double num_1, double num_2){
    return log(num_1) / log(num_2); 
}

double syn (double num_1){
    return sin(num_1 * M_PI / 180); 
}

double kos (double num_1){
    return cos(num_1 * M_PI / 180); 
}

double tang (double num_1){
    return tan(num_1 * M_PI / 180); 
}

double cot (double num_1){
    return cos(num_1) / sin(num_1); 
}

float okruh (float num1){
    return ceil(num1); 
}

void menu ()
{
    printf("Яку дію ви хочете зробити?\n\n");
    printf("1. Сума числ\n");
    printf("2. Добуток числ\n");
    printf("3. Поділити числа\n");
    printf("4. Піднести до степеня\n");
    printf("5. Добути корінь\n");
    printf("6. Обрахувати логарифм\n");
    printf("7. Обрахувати синус\n");
    printf("8. Обрахувати косинус\n");
    printf("9. Обрахувати тангенс\n");
    printf("10. Обрахувати котангенс\n");
    printf("11. Округлити число\n");
    printf("12. Про калькулятор\n");
    printf("13. Вихід\n");
    printf("> ");
}
int main()
{
    int chosen_num;
    double num_1;
    double num_2;
    
while (true)
{
    //SetConsoleCP(1251); 
	//SetConsoleOutputCP(1251);
    setlocale(LC_ALL, "UA"); 
    setlocale(LC_ALL, "Ua");
    menu();
    
    cin >> chosen_num;
    
    system("cls||clear");
    switch (chosen_num) {
    case 1:
        system("cls||clear"); 
        cout << "Введіть перше число: ";
        cin >> num_1;
        cout << "Введіть друге число: ";             
        cin >> num_2;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "              Ви вибрали суму" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                  " << "Результат: " << sum(num_1, num_2) << "                     *"
    << "\n" <<"*                                                   *" << "\n" << endl;
        break;

    case 2:
        system("cls||clear"); 
        cout << "Введіть перше число: ";
        cin >> num_1;
        cout << "Введіть друге число: ";             
        cin >> num_2;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "              Ви вибрали добуток" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                " << "Результат: " << multiplication(num_1, num_2) << "                      *"
    << "\n" <<"*                                                   *" << "\n"  << endl;
        break;

    case 3:
        system("cls||clear"); 
        cout << "Введіть перше число: ";
        cin >> num_1;
        cout << "Введіть друге число: ";             
        cin >> num_2;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "              Ви вибрали ділення" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                      " << "Результат: " << division(num_1, num_2) << "                 *"
    << "\n" <<"*                                                   *" << "\n" << endl;
        break;

    case 4:
        system("cls||clear"); 
        cout << "Введіть перше число: ";
        cin >> num_1;
        cout << "Введіть друге число: ";             
        cin >> num_2;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "              Ви вибрали піднесення до степеня" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                    " << "Результат: " << pover(num_1, num_2) << "                 *"
    << "\n" <<"*                                                   *"  << "\n" << endl;
        break;
    case 5:
        system("cls||clear"); 
        cout << "Введіть перше число: ";
        cin >> num_1;
        cout << "Введіть друге число: ";             
        cin >> num_2;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "         Ви вибрали добування кореня" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                " << "Результат: " << root(num_1, num_2) << "                  *"
    << "\n" <<"*                                                   *" << "\n"  << endl;
        break;
    
    case 6:
        system("cls||clear"); 
        cout << "Введіть число: ";
        cin >> num_1;
        cout << "Введіть основу логарифма: ";             
        cin >> num_2;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "      Ви вибрали обрахування логарифма" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                " << "Результат: " << lg(num_1, num_2) << "                    *"
    << "\n" <<"*                                                   *" << "\n"  << endl;
        break;
        return 0; 
        
    case 7:
        system("cls||clear"); 
        cout << "Введіть синус: ";
        cin >> num_1;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "         Ви вибрали обрахування синуса" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                " << "Результат: " << syn(num_1) << "                    *"
    << "\n" <<"*                                                   *" << "\n"  << endl;
        break;
        return 0;
        
    case 8:
        system("cls||clear"); 
        cout << "Введіть косинус: ";
        cin >> num_1;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "         Ви вибрали обрахування косинуса" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                " << "Результат: " << kos(num_1) << "                    *"
    << "\n" <<"*                                                   *" << "\n"  << endl;
        break;
        return 0;
        
    case 9:
        system("cls||clear"); 
        cout << "Введіть тангенс: ";
        cin >> num_1;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "         Ви вибрали обрахування тангенса" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                " << "Результат: " << tang(num_1) << "                    *"
    << "\n" <<"*                                                   *" << "\n"  << endl;
        break;
        return 0;
        
    case 10:
        system("cls||clear"); 
        cout << "Введіть котангенс: ";
        cin >> num_1;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "         Ви вибрали обрахування котангенса" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                " << "Результат: " << cot(num_1) << "                    *"
    << "\n" <<"*                                                   *" << "\n"  << endl;
        break;
        return 0;
        
    case 11:
        system("cls||clear"); 
        float num1;
        cout << "Введіть число: ";
        cin >> num1;
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "         Ви вибрали округлення числа" << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                                                   *" << "\n"
    << "*                " << "Результат: " << okruh(num1) << "                    *"
    << "\n" <<"*                                                   *" << "\n"  << endl;
        break;
        return 0;
        
    case 12:
        system("cls||clear"); 
        cout << "\n"
    <<"----------------------------------------------------" 
    << "\n" << "\n"
       "                    Про калькулятор" 
       << "\n" << "\n"
    << "----------------------------------------------------"
    << "\n"
    << "*                      Версія: v2.0                 *" << "\n"
    << "*                    ©BOMBA Production              *" <<"\n"
    << "*                      Antonio Shyrko               *" <<"\n\n" << endl;
        break;
        return 0;

    case 13:
        exit(0);
    default:
        cout << "Помилка, Ви ввели некоректне число!" << "\n" << endl;
        cin.get();
    }

}
}